docs: use mermaid diagram for GA+Beta Firebase architecture
Co-authored-by: Nozomi Koborinai <nozomi-koborinai@users.noreply.github.com>
